# Assignment 1: Data Parsing, Cleansing and Integration
## Task 3
#### Student Name: Krishnakanth Srikanth
#### Student ID: s3959200

Date: 03/09/2023

Version: 1.0

Environment: Python 3 and Jupyter notebook

Libraries used: 
* pandas
* re
* numpy
* rand
* warnings


## Introduction

This assessment task is to integrate the output of previous task and the new csv file named s3959200_dataset2.csv. The conflicts that were encountered during this process both in schema level and data level were some columns where missing in the new csv file, some columns headers were different and its values were too different. To resolve these conflicts, new functions were created to create and generate values to the missing columns, renaming the headers as needed, replacing the values as needed and by doing these, the dataframes are made ready for integration. Once integrated, the global key attribute is chosen and finally, the newly merged dataset is exported to a csv file named '__s3959200_dataset_integrated.csv__'.

<span style="color: red"> Note that this is a sample notebook only. You will need to fill in the proper markdown and code blocks. You might also want to make necessary changes to the structure to meet your own needs. Note also that any generic comments written in this notebook are to be removed and replace with your own words.</span>

##  Import libraries

In [1]:
# Code to import libraries as you need in this assessment
import pandas as pd
pd.set_option('display.max_columns', None) # Display all columns
import numpy as np
import random as rand
import warnings
warnings.filterwarnings("ignore") # To ignore warnings

### 1. Examining and loading data
Examine "\<student\_id\>_dataset2.csv" the structure and schema.

In [2]:
# Code to inspect the provided data file
# Couple of notes for all code block in this notebook
## please provide proper comment on your code
## Please re-start and run all cells to make sure codes are runable and include your output in the submission
task1_data = pd.read_csv('s3959200_dataset1_solution.csv', header=0)
task2_data = pd.read_csv('s3959200_dataset2.csv', header=0)

In [3]:
task1_data.head()

,Id,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,SourceName
0,63129905,"Nursery Nurse, Liverpool",liverpool,Caring Services NW,full_time,contract,Teaching Jobs,12480.0,2013-09-17 15:00:00,2013-11-16 15:00:00,fish4.co.uk
1,69830611,Money/Welfare Advice Workers (x****),uk,non-specified,full_time,contract,Accounting & Finance Jobs,24700.0,2012-12-30 12:00:00,2013-02-28 12:00:00,fish4.co.uk
2,69219032,Senior Design Engineer up to ****,uk,Huxley Associates,full_time,permanent,Engineering Jobs,37500.0,2012-09-03 15:00:00,2012-12-02 15:00:00,fish4.co.uk
3,69221223,Photocopier Service Engineer,manchester,ETS Technical Selection,full_time,permanent,IT Jobs,20000.0,2013-12-31 12:00:00,2014-03-31 12:00:00,fish4.co.uk
4,69191387,Digital Advertising Sales Executive (Leading O...,aberdeen,Choice Consultants,full_time,permanent,"PR, Advertising & Marketing Jobs",12500.0,2013-06-14 00:00:00,2013-09-12 00:00:00,fish4.co.uk

In [4]:
task2_data.head()

,Monthly Payment,Closing,Organisation,Location,Category,Full-Time Equivalent (FTE),Opening,Job Title,Type
0,1200.00,2012-12-27 12:00:00,Protocol Education,UK,Education,0.8,2012-11-27 12:00:00,Higher Level Teaching Assistant (HLTA),NaN
1,3125.00,2013-08-25 15:00:00,Cordius Ltd,UK,Information Technology,1.0,2013-06-26 15:00:00,Software Developers / Software Architects Not...,Permanent
2,4333.33,2013-01-16 15:00:00,Understanding Recruitment,Walton-On-Thames,Information Technology,1.0,2012-10-18 15:00:00,Senior BI Consultant (Cognos),Permanent
3,3750.00,2013-02-13 15:00:00,Wallace Hind Selection,UK,Sales,1.0,2012-12-15 15:00:00,"Technical Sales Manager, Pigments Fillers to S...",NaN
4,2916.67,2013-01-12 12:00:00,Greenhill Group Ltd,Eastern England,Sales,1.0,2012-12-29 12:00:00,Channel Account Manager Software,NaN

###### Data Overview for Detecting Conflicts

In [5]:
task1_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50753 entries, 0 to 50752
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            50753 non-null  int64
 1   Title         50753 non-null  object
 2   Location      50753 non-null  object
 3   Company       50753 non-null  object
 4   ContractType  50753 non-null  object
 5   ContractTime  50753 non-null  object
 6   Category      50753 non-null  object
 7   Salary        50753 non-null  float64
 8   OpenDate      50753 non-null  object
 9   CloseDate     50753 non-null  object
 10  SourceName    50753 non-null  object
dtypes: float64(1), int64(1), object(9)
memory usage: 4.3+ MB

In [6]:
task2_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Monthly Payment             5000 non-null   float64
 1   Closing                     5000 non-null   object
 2   Organisation                4514 non-null   object
 3   Location                    5000 non-null   object
 4   Category                    5000 non-null   object
 5   Full-Time Equivalent (FTE)  5000 non-null   float64
 6   Opening                     5000 non-null   object
 7   Job Title                   5000 non-null   object
 8   Type                        3580 non-null   object
dtypes: float64(2), object(7)
memory usage: 351.7+ KB

### 2. Resolving schema conflicts
After careful analysis, the __task2_data has the '_ID_' column missing__ which is created using __random__ function.
__task2_data misses the SourceName column__ which we get from the requirement document as _www.jobhuntlisting.com_ since the dataset is fetched from that website.
Also, the __task2_data does not have the values that matches the values in task1_data for respective features__. This is handled by correcting the values according with respect to task1_data in task2_data. And also, __renaming the columns of task2_data to match the columns of task1_data__

<span style="color: red"> You might have complex notebook structure in this section, please feel free to create your own notebook structure. </span>

In [7]:
# Code to inspect data and identify conflicts in schema
# Checking datatypes of task1_data before resolving conflicts
task1_data.dtypes

Id                int64
Title            object
Location         object
Company          object
ContractType     object
ContractTime     object
Category         object
Salary          float64
OpenDate         object
CloseDate        object
SourceName       object
dtype: object

In [8]:
# Checking datatypes of task2_data before resolving conflicts
task2_data.dtypes

Monthly Payment               float64
Closing                        object
Organisation                   object
Location                       object
Category                       object
Full-Time Equivalent (FTE)    float64
Opening                        object
Job Title                      object
Type                           object
dtype: object

#### Conflict 1: The task2_data does not have an Id column
The main task of this part of assignment is to integrate the dataset from previous task (s3959200_dataset1_solution.csv) and the new dataset (s3959200_dataset2.csv). To achieve this, we need to have the features in both the datasets same. Here, in the second dataset, there is no Id column as in dataset 1. Hence, creating Id column with 8 values, to resolve the conflict in the schema.

In [9]:
# Code to fix the conflict
# Creating a random ID generator for dataset 2
id_set = set()
task1_data_id = task1_data['Id'].values.tolist()
i = 0
while i < len(task2_data):
    task2_data_id = rand.randint(1e7, 1e8-1)
    if (task2_data_id in task1_data_id) or (task2_data_id in id_set):
        continue
    else:
        id_set.add(task2_data_id)
        i = i+1
id_list = list(id_set)
task2_data['Id'] = id_list

#### Conflict 2: The task2_data does not have SourceName column
Like the Conflict 1, the second dataset has no SourceName column. Hence, creating SourceName column with a default value of 'www.jobhuntlisting.com' as the dataset is obtained from that source.

In [10]:
# Creating SourceName column in task2_data
task2_data['SourceName'] = 'www.jobhuntlisting.com'

#### Conflict 3: Making the features and values in the task2_data same as task1_data
task1_data has features namely: Id, Title, Location, Company, ContractType, ContractTime, Category, Salary, OpenDate, CloseDate, SourceName whereas task2_data has features Monthly Payment, Closing, Organisation, Location, Category, Full-Time Equivalent (FTE), Opening, Job Title, Type, Id, SourceName. To resolve the conflicts during merging, we need to make the columns and values in both the datasets same.

##### Conflict 3.1: Converting 'Monthly Payment' to yearly and renaming the column to 'Salary'

In [11]:
# Checking on column 'Monthly Payment'
# This column gives us details about the monthly salary of an employee. 
# We can make this field to yearly salary which would match 'Salary' column in task1_data
task2_data['Monthly Payment'] = task2_data['Monthly Payment'].apply(lambda sal: sal * 12)

# Renaming the column to 'Salary'
task2_data.rename(columns=({'Monthly Payment':'Salary'}), inplace=True)

##### Conflict 3.2: Renaming columns to match the columns in task1_data

In [12]:
# Renaming 'Closing' to 'CloseDate', 'Organisation' to 'Company', 'Opening' to 'OpenDate', 'Job Title' to 'Title'
task2_data.rename(columns=({'Closing':'CloseDate', 'Organisation':'Company', 'Opening':'OpenDate', 
                           'Job Title':'Title'}), inplace=True)

##### Conflict 3.3: Inspecting 'Category' column and making it same as task1_data

In [13]:
# Checking the column 'Category' in task2_data
task2_data['Category'].value_counts()

Information Technology    1317
Health                     789
Engineering                744
Finance                    668
Sales                      498
Hospitality                399
Education                  326
Marketing                  259
Name: Category, dtype: int64

In [14]:
# Checking the column 'Category' in task1_data
task1_data['Category'].value_counts()

IT Jobs                             13118
Healthcare & Nursing Jobs            8071
Engineering Jobs                     7522
Accounting & Finance Jobs            6782
Sales Jobs                           4879
Hospitality & Catering Jobs          4400
Teaching Jobs                        3469
PR, Advertising & Marketing Jobs     2512
Name: Category, dtype: int64

In [15]:
# Replacing values in 'Category' column of task2_data same as task1_data
task2_data['Category'].replace(to_replace= 'Information Technology', value = 'IT Jobs', inplace=True)
task2_data['Category'].replace(to_replace= 'Health', value = 'Healthcare & Nursing Jobs', inplace=True)
task2_data['Category'].replace(to_replace= 'Engineering', value = 'Engineering Jobs', inplace=True)
task2_data['Category'].replace(to_replace= 'Finance', value = 'Accounting & Finance Jobs', inplace=True)
task2_data['Category'].replace(to_replace= 'Sales', value = 'Sales Jobs', inplace=True)
task2_data['Category'].replace(to_replace= 'Hospitality', value = 'Hospitality & Catering Jobs', inplace=True)
task2_data['Category'].replace(to_replace= 'Education', value = 'Teaching Jobs', inplace=True)
task2_data['Category'].replace(to_replace= 'Marketing', value = 'PR, Advertising & Marketing Jobs', inplace=True)

##### Conflict 3.4: Inspecting 'Full-Time Equivalent (FTE)' column and making it same as task1_data, renaming the column to 'ContractType'

In [16]:
# Checking the column 'Full-Time Equivalent (FTE)' in task2_data
task2_data['Full-Time Equivalent (FTE)'].value_counts()

1.0    4834
0.4      47
0.8      41
0.6      39
0.2      39
Name: Full-Time Equivalent (FTE), dtype: int64

In [17]:
# Checking the column 'ContractType' in task1_data
task1_data['ContractType'].value_counts()

non-specified    38082
full_time        11250
part_time         1421
Name: ContractType, dtype: int64

In [18]:
# Replacing values '1.0' to 'full_time' and others to 'part_time' and renaming to 'ContractType'
task2_data['Full-Time Equivalent (FTE)'] = task2_data['Full-Time Equivalent (FTE)'].apply(lambda val : 'full_time' if val == '1.0' else 'part_time')
task2_data.rename(columns=({'Full-Time Equivalent (FTE)':'ContractType'}), inplace=True)

##### Conflict 3.5: Replacing the values in 'Location' to lower case to match case in task1_data

In [19]:
task2_data['Location'] = task2_data['Location'].apply(lambda loc : loc.lower())

##### Conflict 3.6: Inspecting 'Type' column and making it same as task1_data, renaming the column to 'ContractTime'

In [20]:
# Checking the column 'Type' in task2_data
task2_data['Type'].value_counts()

Permanent              3040
Fixed Term Contract     540
Name: Type, dtype: int64

In [21]:
# Checking the column 'ContractTime' in task1_data
task1_data['ContractTime'].value_counts()

permanent        31024
non-specified    14101
contract          5628
Name: ContractTime, dtype: int64

In [22]:
# Replacing values to match the task1_data and renaming to 'ContractTime'
task2_data['Type'] = task2_data['Type'].apply(lambda x : 'contract' if x == 'Fixed Term Contract' else x)
task2_data['Type'] = task2_data['Type'].apply(lambda x : x.lower() if x is not np.nan else x)
task2_data.rename(columns=({'Type':'ContractTime'}), inplace=True)

##### Conflict 3.7: Converting datatypes of 'OpenDate' and 'CloseDate' to datetime

In [23]:
task1_data['OpenDate'] = pd.to_datetime(task1_data['OpenDate'])
task1_data['CloseDate'] = pd.to_datetime(task1_data['CloseDate'])

task2_data['OpenDate'] = pd.to_datetime(task2_data['OpenDate'])
task2_data['CloseDate'] = pd.to_datetime(task2_data['CloseDate'])

#### Conflict 4: Rearranging the columns in task2_data same as task1_data

In [24]:
task2_data = task2_data[['Id', 'Title', 'Location', 'Company', 'ContractType', 'ContractTime', 
                         'Category', 'Salary', 'OpenDate', 'CloseDate', 'SourceName']]

In [25]:
# Viewing the dataset after correcting the conflicts
task2_data.head()

,Id,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,SourceName
0,26836993,Higher Level Teaching Assistant (HLTA),uk,Protocol Education,part_time,NaN,Teaching Jobs,14400.00,2012-11-27 12:00:00,2012-12-27 12:00:00,www.jobhuntlisting.com
1,66519048,Software Developers / Software Architects Not...,uk,Cordius Ltd,part_time,permanent,IT Jobs,37500.00,2013-06-26 15:00:00,2013-08-25 15:00:00,www.jobhuntlisting.com
2,53542920,Senior BI Consultant (Cognos),walton-on-thames,Understanding Recruitment,part_time,permanent,IT Jobs,51999.96,2012-10-18 15:00:00,2013-01-16 15:00:00,www.jobhuntlisting.com
3,84705292,"Technical Sales Manager, Pigments Fillers to S...",uk,Wallace Hind Selection,part_time,NaN,Sales Jobs,45000.00,2012-12-15 15:00:00,2013-02-13 15:00:00,www.jobhuntlisting.com
4,32833563,Channel Account Manager Software,eastern england,Greenhill Group Ltd,part_time,NaN,Sales Jobs,35000.04,2012-12-29 12:00:00,2013-01-12 12:00:00,www.jobhuntlisting.com

In [26]:
# Checking the datatypes of task1_data after resolving conflicts
task1_data.dtypes

Id                       int64
Title                   object
Location                object
Company                 object
ContractType            object
ContractTime            object
Category                object
Salary                 float64
OpenDate        datetime64[ns]
CloseDate       datetime64[ns]
SourceName              object
dtype: object

In [27]:
# Checking the datatypes of task2_data after resolving conflicts
task2_data.dtypes

Id                       int64
Title                   object
Location                object
Company                 object
ContractType            object
ContractTime            object
Category                object
Salary                 float64
OpenDate        datetime64[ns]
CloseDate       datetime64[ns]
SourceName              object
dtype: object

......

### 3. Merging data

<span style="color: red"> You might have complex notebook structure in this section, please feel free to create your own notebook structure. </span>

In [28]:
# Code to merge two data sets
task3_data_integrated = pd.concat([task1_data, task2_data], ignore_index=True)
task3_data_integrated.head(10)

,Id,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,SourceName
0,63129905,"Nursery Nurse, Liverpool",liverpool,Caring Services NW,full_time,contract,Teaching Jobs,12480.0,2013-09-17 15:00:00,2013-11-16 15:00:00,fish4.co.uk
1,69830611,Money/Welfare Advice Workers (x****),uk,non-specified,full_time,contract,Accounting & Finance Jobs,24700.0,2012-12-30 12:00:00,2013-02-28 12:00:00,fish4.co.uk
2,69219032,Senior Design Engineer up to ****,uk,Huxley Associates,full_time,permanent,Engineering Jobs,37500.0,2012-09-03 15:00:00,2012-12-02 15:00:00,fish4.co.uk
3,69221223,Photocopier Service Engineer,manchester,ETS Technical Selection,full_time,permanent,IT Jobs,20000.0,2013-12-31 12:00:00,2014-03-31 12:00:00,fish4.co.uk
4,69191387,Digital Advertising Sales Executive (Leading O...,aberdeen,Choice Consultants,full_time,permanent,"PR, Advertising & Marketing Jobs",12500.0,2013-06-14 00:00:00,2013-09-12 00:00:00,fish4.co.uk
5,69214043,Performing Arts Drama Music Art QTS Supply Tea...,tamworth,Aspire People Limited,part_time,permanent,Teaching Jobs,28800.0,2013-09-09 00:00:00,2013-10-09 00:00:00,fish4.co.uk
6,62111940,Systems Design / Weapons Systems Engineers,bristol,Mass Consultants Ltd,full_time,permanent,Engineering Jobs,45000.0,2012-11-23 12:00:00,2012-12-23 12:00:00,fish4.co.uk
7,70321231,Internal Sales Supervisor Berkshire,uk,Additional Resources,full_time,permanent,Sales Jobs,45000.0,2013-05-19 00:00:00,2013-06-18 00:00:00,fish4.co.uk
8,62113885,Teacher of Psychology,uk,Strategy Education,full_time,permanent,Teaching Jobs,32400.0,2013-09-01 15:00:00,2013-10-01 15:00:00,fish4.co.uk
9,68509853,Team Leader/Support Coordinator,cheshire,non-specified,full_time,permanent,Healthcare & Nursing Jobs,20396.0,2012-04-09 15:00:00,2012-07-08 15:00:00,fish4.co.uk

### 4. Resolving data conflicts:
Give some general information about the data conflicts you found in the unified table and how you resolve them.

<span style="color: red"> You might have complex notebook structure in this section, please feel free to create your own notebook structure. </span>

#### Conflict 1: Check for duplicates
Here, the newly merged dataset is checked for the presence of any duplicate values/entries.

In [29]:
# Code to inspect data and identify conflicts in data
# Code to fix the conflict
task3_data_integrated.duplicated().sum()

0

#### Conflict 2: Check for nan and replacing it to 'non-specified'
Here, the newly merged dataset is checked for the presence of any nan values, if so, it is changed to 'non-specified'

In [30]:
task3_data_integrated.replace(np.nan, 'non-specified', inplace=True)

......

#### Finding global key for the data
A key should be an unique value without any duplicates. Hence, choosing column **'Id'** as a key since it is unique without any duplicates.

In [31]:
# Code to identify global key
task3_data_integrated.duplicated(subset=['Id']).sum()

0

.......

### 5. Saving the integrated and reshaped data
The last part of the integration process is to export our output data to csv format, named as:
- '\<student\_id\>_dataset_integrated.csv'

In [32]:
# code to save output data
task3_data_integrated.to_csv('s3959200_dataset_integrated.csv', index=False)

## Summary of the Assessment Task
Give a short summary and anything you would like to talk about this assessment task here.

- In this task, I have learnt how to merge two datasets by analyzing, spotting and resolving the conflicts both in schema level and data level one by one.
- Finding a global key attribute for the dataset.